# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику.
# Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод
# – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.
import random


def input_num(message: str) -> int:
    input_error: bool = True
    while input_error:
        try:
            temp = int(input(message))
        except ValueError:
            print("Вы ввели не число!")
        else:
            input_error = False
            return temp


def random_ring(size: int) -> list:
    g = []
    for _ in range(size):
        g.append(random.randint(1, 5))
    return g


def find_rich(g: list) -> int:
    rich_near = 0
    for i in range(len(g)):
        if sum(g[i - 1:i + 2]) > rich_near:
            rich_near = sum(g[i - 1:i + 2])
    return rich_near


n = input_num('Please input size of garden bed: ')
garden = random_ring(n)
print(garden)
print(find_rich(garden + garden[:2]))
